tests/integration/cassettes/TestInvoice.test_create.json

{
  "http_interactions": [
    {
      "recorded_at": "2020-02-18T17:28:11",
      "request": {
        "body": {
          "encoding": "utf-8",
          "string": "{\"service_period_to\": \"2019-12-31\", \"due_date\": \"2018-10-16\", \"service_period_from\": \"2019-12-01\", \"title\": \"invoice\", \"status\": \"created\", \"items\": [{\"type\": \"title\", \"title\": \"Hours\"}, {\"type\": \"description\", \"description\": \"Listing of all hours\"}, {\"title\": \"Service\", \"net_total\": 130, \"quantity\": 2, \"type\": \"item\", \"unit_price\": 65, \"unit\": \"hours\"}], \"tax\": 8.0, \"change_address\": \"invoice\", \"customer_id\": 760748876, \"currency\": \"EUR\", \"date\": \"2018-09-17\", \"recipient_address\": \"Mein Kunde\\nHauptstrasse 1\\n8000 Z\\u00fcrich\"}"
        },
        "headers": {
          "Accept": [
            "*/*"
          ],
          "Accept-Encoding": [
            "gzip, deflate"
          ],
          "Authorization": [
            "Token token=<TOKEN>"
          ],
          "Connection": [
            "keep-alive"
          ],
          "Content-Length": [
            "534"
          ],
          "Content-Type": [
            "application/json"
          ],
          "User-Agent": [
            "python-requests/2.22.0"
          ]
        },
        "method": "POST",
        "uri": "https://<DOMAIN>.mocoapp.com/api/v1/invoices"
      },
      "response": {
        "body": {
          "base64_string": "H4sIAAAAAAAA/6xTTW/UMBD9K9GcnWKn203Wd6RKwKXApbSKXHu2a0jsYI9XrND+M278MeRkP1JWKhduzrznmZc3zz/BGpDNalFzzkCnSL7H0OZiveT1omnqJYMh+K+oaSy71HUMrEFHdm0xgIS7inNe1cDAKEKQUHHRlHxVirGWsJ3XBS/FEhhEDFursR0wWG9AgqjeVFysLqB2HXw/3V6Voiq5uKSQnxGuRwIpShEk6ICK0ACDgFsMUXUg16qLyIAsdVmXdVtvNY4UbQeLjlplTMCYG3xA64p3yRl8cLcqDRQpqBixEA+u4ZwX979/Bas3kA0MAZ3egYS3n++AgUNqyVOeKa75FWdA6gfIJp+eg4/xhC741YKBsVH75AjkSNYqbtrXaq1Ru3gADD5Zal3qn/JWpj3pgOai2Hn9Dc3ZBfUcQX55ZEerWkWjmxUveVWK5pOoZdVIwe+BQRrMaxyROcc+3r3gzG5fIlF1iRTZEQEGa+9pTBcwsIR9ljildVE1NzVfMqDdkLc3bfG8zVufQszBw6iDHaaW059/T8qRpd3BseQsHaF8boeQYzCBs9XxK75n8+H1afh8yEnC1PHFfHhvI1n3XPh1obqu2BxE/i9FzUlRNmvmxsfpofzLj+o8HY7a5gKWN38pGOO8f2QwqF2Pjg4RCthbZzCMn/s/AQAA///2G9XzXwQAAA==",
          "encoding": "utf-8",
          "string": ""
        },
        "headers": {
          "Cache-Control": [
            "max-age=0, private, must-revalidate"
          ],
          "Content-Encoding": [
            "gzip"
          ],
          "Content-Length": [
            "526"
          ],
          "Content-Type": [
            "application/json; charset=utf-8"
          ],
          "Date": [
            "Tue, 18 Feb 2020 17:28:11 GMT"
          ],
          "Etag": [
            "W/\"876d43ce1deac496dafcc43d77f8377a\""
          ],
          "Referrer-Policy": [
            "strict-origin-when-cross-origin"
          ],
          "Vary": [
            "Origin",
            "Accept-Encoding"
          ],
          "X-Content-Type-Options": [
            "nosniff"
          ],
          "X-Download-Options": [
            "noopen"
          ],
          "X-Frame-Options": [
            "SAMEORIGIN"
          ],
          "X-Permitted-Cross-Domain-Policies": [
            "none"
          ],
          "X-Request-Id": [
            "38c59004-4c2b-4c51-ba8a-699ad8330e68"
          ],
          "X-Runtime": [
            "1.217065"
          ],
          "X-Xss-Protection": [
            "1; mode=block"
          ]
        },
        "status": {
          "code": 200,
          "message": "OK"
        },
        "url": "https://<DOMAIN>.mocoapp.com/api/v1/invoices"
      }
    }
  ],
  "recorded_with": "betamax/0.8.1"
}