tests/integration/cassettes/TestInvoice.test_get.json

{
  "http_interactions": [
    {
      "recorded_at": "2020-02-18T09:58:34",
      "request": {
        "body": {
          "encoding": "utf-8",
          "string": "{\"customer_id\": 760747823, \"title\": \"invoice\", \"service_period_from\": \"2019-12-01\", \"status\": \"created\", \"currency\": \"EUR\", \"tax\": 8.0, \"change_address\": \"invoice\", \"items\": [{\"type\": \"title\", \"title\": \"Hours\"}, {\"description\": \"Listing of all hours\", \"type\": \"description\"}, {\"unit_price\": 65, \"net_total\": 130, \"type\": \"item\", \"title\": \"Service\", \"quantity\": 2, \"unit\": \"hours\"}], \"date\": \"2018-09-17\", \"recipient_address\": \"Mein Kunde\\nHauptstrasse 1\\n8000 Z\\u00fcrich\", \"service_period_to\": \"2019-12-31\", \"due_date\": \"2018-10-16\"}"
        },
        "headers": {
          "Accept": [
            "*/*"
          ],
          "Accept-Encoding": [
            "gzip, deflate"
          ],
          "Authorization": [
            "Token token=10cee7728f7aa84e73f982cdb1e46290"
          ],
          "Connection": [
            "keep-alive"
          ],
          "Content-Length": [
            "534"
          ],
          "Content-Type": [
            "application/json"
          ],
          "User-Agent": [
            "python-requests/2.22.0"
          ]
        },
        "method": "POST",
        "uri": "https://v6zcg2argh.mocoapp.com/api/v1/invoices"
      },
      "response": {
        "body": {
          "base64_string": "H4sIAAAAAAAA/6xTTW/UMBD9K6s5O8VOsk3Wd6RKwKXApbSKXHu2NSR2sMcVK9R/xo0/hpzsR8pK5cLNmfc88/Lm+SdYA7LdVG3TMNApkh8wdLnYXPKmbtqyYjAG/xU1TWWX+p6BNejIbi0GkHBdcs55AwyMIgQJJRdtwTeFmGoJu2Vd8EJcAoOI4clq7EYM1huQIMo3JRebM6jbBj/MtzeFKAsuzinkF4RqIpCiFEGCDqgIDTAI+IQhqh7kVvURGZClPuuy7slbjRNF29Gio04ZEzDmBh/QutW75AzeuiuVRooUVIy4Ereu5Zyvbn7/ClY/QjYwBHR6BxLefr4GBg6pI095pqj4BWdA6gfINp8ego/xiNb8omZgbNQ+OQI5kbWKj91rtc6oXdwDBu8tdS4N93kr8550QHNW7L3+hubkgnqIIL/csYNVnaLJzZIXvCxE+4lv5LqVVXUDDNJoXuPUmXPo490LzuL2ORJVn0iRnRBgsPWepnQBA0s4ZIlzWuuyFescS9qNeXvzFk/bvPIpxBw8jDrYcW45//n3pBxZ2u0dS87SAcrnbgw5BjO4WB2/4M9sObw+Dl8OOUqYO76YD+9tJOseVn67Un2/etyL/F+K1kdF2ayFGx/nh/IvP8rTdDhoWwq4XP+lYIrz8x2DUe0GdLSPUMDBOoNh+nz+EwAA//8M154cXwQAAA==",
          "encoding": "utf-8"
        },
        "headers": {
          "Cache-Control": [
            "max-age=0, private, must-revalidate"
          ],
          "Content-Encoding": [
            "gzip"
          ],
          "Content-Length": [
            "526"
          ],
          "Content-Type": [
            "application/json; charset=utf-8"
          ],
          "Date": [
            "Tue, 18 Feb 2020 09:58:34 GMT"
          ],
          "Etag": [
            "W/\"69646ab95bb5cfa0e688dfa29ef014be\""
          ],
          "Referrer-Policy": [
            "strict-origin-when-cross-origin"
          ],
          "Vary": [
            "Origin",
            "Accept-Encoding"
          ],
          "X-Content-Type-Options": [
            "nosniff"
          ],
          "X-Download-Options": [
            "noopen"
          ],
          "X-Frame-Options": [
            "SAMEORIGIN"
          ],
          "X-Permitted-Cross-Domain-Policies": [
            "none"
          ],
          "X-Request-Id": [
            "d75c901f-9d61-4377-adee-35f3dcf456be"
          ],
          "X-Runtime": [
            "1.210774"
          ],
          "X-Xss-Protection": [
            "1; mode=block"
          ]
        },
        "status": {
          "code": 200,
          "message": "OK"
        },
        "url": "https://v6zcg2argh.mocoapp.com/api/v1/invoices"
      }
    },
    {
      "recorded_at": "2020-02-18T09:58:34",
      "request": {
        "body": {
          "encoding": "utf-8",
          "string": ""
        },
        "headers": {
          "Accept": [
            "*/*"
          ],
          "Accept-Encoding": [
            "gzip, deflate"
          ],
          "Authorization": [
            "Token token=10cee7728f7aa84e73f982cdb1e46290"
          ],
          "Connection": [
            "keep-alive"
          ],
          "Content-Type": [
            "application/json"
          ],
          "User-Agent": [
            "python-requests/2.22.0"
          ]
        },
        "method": "GET",
        "uri": "https://v6zcg2argh.mocoapp.com/api/v1/invoices/893877"
      },
      "response": {
        "body": {
          "base64_string": "H4sIAAAAAAAA/6xTTW/UMBD9K6s5O8VOsk3Wd6RKwKXApbSKXHu2NSR2sMcVK9R/xo0/hpzsR8pK5cLNmfc88/Lm+SdYA7LdVG3TMNApkh8wdLnYXPKmbtqyYjAG/xU1TWWX+p6BNejIbi0GkHBdcs55AwyMIgQJJRdtwTeFmGoJu2Vd8EJcAoOI4clq7EYM1huQIMo3JRebM6jbBj/MtzeFKAsuzinkF4RqIpCiFEGCDqgIDTAI+IQhqh7kVvURGZClPuuy7slbjRNF29Gio04ZEzDmBh/QutW75AzeuiuVRooUVIy4Ereu5Zyvbn7/ClY/QjYwBHR6BxLefr4GBg6pI095pqj4BWdA6gfINp8ego/xiNb8omZgbNQ+OQI5kbWKj91rtc6oXdwDBu8tdS4N93kr8550QHNW7L3+hubkgnqIIL/csYNVnaLJzZIXvCxE+4lv5LqVVXUDDNJoXuPUmXPo490LzuL2ORJVn0iRnRBgsPWepnQBA0s4ZIlzWuuyFescS9qNeXvzFk/bvPIpxBw8jDrYcW45//n3pBxZ2u0dS87SAcrnbgw5BjO4WB2/4M9sObw+Dl8OOUqYO76YD+9tJOseVn67Un2/etyL/F+K1kdF2ayFGx/nh/IvP8rTdDhoWwq4XP+lYIrz8x2DUe0GdLSPUMDBOoNh+nz+EwAA//8M154cXwQAAA==",
          "encoding": "utf-8"
        },
        "headers": {
          "Cache-Control": [
            "max-age=0, private, must-revalidate"
          ],
          "Content-Encoding": [
            "gzip"
          ],
          "Content-Length": [
            "526"
          ],
          "Content-Type": [
            "application/json; charset=utf-8"
          ],
          "Date": [
            "Tue, 18 Feb 2020 09:58:34 GMT"
          ],
          "Etag": [
            "W/\"69646ab95bb5cfa0e688dfa29ef014be\""
          ],
          "Referrer-Policy": [
            "strict-origin-when-cross-origin"
          ],
          "Vary": [
            "Origin",
            "Accept-Encoding"
          ],
          "X-Content-Type-Options": [
            "nosniff"
          ],
          "X-Download-Options": [
            "noopen"
          ],
          "X-Frame-Options": [
            "SAMEORIGIN"
          ],
          "X-Permitted-Cross-Domain-Policies": [
            "none"
          ],
          "X-Request-Id": [
            "5ecfe698-667c-414b-b3cf-4faa72186d96"
          ],
          "X-Runtime": [
            "0.262512"
          ],
          "X-Xss-Protection": [
            "1; mode=block"
          ]
        },
        "status": {
          "code": 200,
          "message": "OK"
        },
        "url": "https://v6zcg2argh.mocoapp.com/api/v1/invoices/893877"
      }
    }
  ],
  "recorded_with": "betamax/0.8.1"
}