tests/integration/cassettes/TestInvoicePayment.test_create_bulk.json

{
  "http_interactions": [
    {
      "recorded_at": "2020-11-24T07:03:37",
      "request": {
        "body": {
          "encoding": "utf-8",
          "string": "{\"bulk_data\": [{\"currency\": \"EUR\", \"paid_total\": 200, \"invoice_id\": 1273230, \"date\": \"2020-01-01\"}, {\"currency\": \"EUR\", \"paid_total\": 150, \"invoice_id\": 1273230, \"date\": \"2020-01-02\"}]}"
        },
        "headers": {
          "Accept": [
            "*/*"
          ],
          "Accept-Encoding": [
            "gzip, deflate"
          ],
          "Authorization": [
            "Token token=<TOKEN>"
          ],
          "Connection": [
            "keep-alive"
          ],
          "Content-Length": [
            "185"
          ],
          "Content-Type": [
            "application/json"
          ],
          "User-Agent": [
            "python-requests/2.23.0"
          ]
        },
        "method": "POST",
        "uri": "https://<DOMAIN>.mocoapp.com/api/v1/invoices/payments/bulk"
      },
      "response": {
        "body": {
          "base64_string": "H4sIAAAAAAAA/7TPwUoDMRDG8VeR7zwrk4luIHdfoOhFkRCSCANttiwToUjfXUSrBQ966fXjnzC/pzdoRQyzn2ch1GwNEcLCE7uJHQjaXxctDfEzdRK8eCZobd30RduKiI0wMwcQTG378Ucdu93h6vT4SNhnrckWy1tEYb7m8ylpT7mUZXRLZaxr6+Xwnf0MuHvYgFDWlq3VlO10rHOT3NxziOyjD48gjH39oznSGd7/xsuF8O72X/iv7FL45/cAAAD//yP7iyn7AQAA",
          "encoding": "utf-8",
          "string": ""
        },
        "headers": {
          "Cache-Control": [
            "max-age=0, private, must-revalidate"
          ],
          "Content-Encoding": [
            "gzip"
          ],
          "Content-Length": [
            "204"
          ],
          "Content-Type": [
            "application/json; charset=utf-8"
          ],
          "Date": [
            "Tue, 24 Nov 2020 07:03:37 GMT"
          ],
          "Etag": [
            "W/\"1bef3a455fcf6f4c4bf375bca7740f66\""
          ],
          "Referrer-Policy": [
            "strict-origin-when-cross-origin"
          ],
          "Vary": [
            "Origin",
            "Accept-Encoding"
          ],
          "X-Content-Type-Options": [
            "nosniff"
          ],
          "X-Download-Options": [
            "noopen"
          ],
          "X-Frame-Options": [
            "SAMEORIGIN"
          ],
          "X-Permitted-Cross-Domain-Policies": [
            "none"
          ],
          "X-Request-Id": [
            "5ddc4008-b337-4c65-a626-dcdd796bc824"
          ],
          "X-Runtime": [
            "0.267313"
          ],
          "X-Xss-Protection": [
            "1; mode=block"
          ]
        },
        "status": {
          "code": 200,
          "message": "OK"
        },
        "url": "https://<DOMAIN>.mocoapp.com/api/v1/invoices/payments/bulk"
      }
    }
  ],
  "recorded_with": "betamax/0.8.1"
}